app/Controllers/PostController.php

    public function index()
    {
        $postModel = new PostModel();
        $userModel = new UserModel();
        $likeModel = new LikeModel();

        // Get filter/search from query parameters
        $search = $this->request->getGet('search');
        $userID = $this->request->getGet('user');

        $post = $postModel->findAll();

        // Base query
        $builder = $postModel->select('Post.*, User.Username')
                            ->join('User', 'User.UserID = Post.UserID', 'left');

        // Search by title
        if (!empty($search)) {
            $builder->like('Post.Title', $search);
        }

        // Filter by user
        if (!empty($userID)) {
            $builder->where('Post.UserID', $userID);
        }

        $posts = $builder->orderBy('Post.PublicationDate', 'DESC')->findAll();

        // Fetch all users for the dropdown filter
        $users = $userModel->select('UserID, Username')->findAll();
---
SELECT `Post`.*, `User`.`Username`
FROM `Post`
LEFT JOIN `User` ON `User`.`UserID` = `Post`.`UserID`
ORDER BY `Post`.`PublicationDate` DESC
SELECT `UserID`, `Username`
FROM `User`

    public function delete($id)
    {
        $postModel = new PostModel();
        $post = $postModel->find($id);

        if (!$post) {
            return redirect()->to('/posts')->with('error', 'Post not found.');
---
SELECT `Post`.*, `User`.`Username`
FROM `Post`
LEFT JOIN `User` ON `User`.`UserID` = `Post`.`UserID`
WHERE `Post`.`PostID` = '5'
 LIMIT 1