app/Models/UserModel.php

SELECT *
FROM `User`
WHERE `Email` = 'admin@gmail.com'
 LIMIT 1
---
    public function getByEmail($email)
    {
        return $this->where('Email', $email)->first();